article/calendar/index.org
#+TITLE: PPL -- Syllabus
#+SETUPFILE: ../setup.org

-----

| Week              | Topics                                           | Homework   |
|-------------------+--------------------------------------------------+------------|
| 1 (Aug 18, 20)    | Introduction to {{{LOGO}}} and me, preliminaries |            |
| 2 (Aug 25, 27)    | Preliminaries and brief history                  | Homework 1 |
| 3 (Sep 1, 3)      | Describing syntax and semantics, BNF and eBNF    |            |
| 4 (Sep 8, 10)     | Describing syntax and semantics, BNF and eBNF    | Homework 2 |
| 5 (Sep 15, 17)    | Variable names, bindings and scope               | Homework 3 |
| 6 (Sep 22, 24)    | Review for midterm and midterm exam              |            |
| 7 (Sep 29, Oct 1) | Data Types                                       |            |
| 8 (Oct 6, 8)      | Statement and flow control                       |            |
| 9 (Oct 13, +15+)  | Sub-programms                                    |            |
| 10 (Oct 20, 22)   | Sub-programms implementation                     | Homework 4 |
| 11 (Oct 27, 29)   | Abstract data types                              |            |
| 12 (Nov 3, 5)     | Concurrency                                      | Homework 5 |
| 13 (Nov 10, 12)   | Prolog and Javascript                            | Homework 6 |
| 14 (Nov 17, 20)   | Exception Handling                               |            |
| +15 (Nov 24, 26)+ |                                                  |            |
| 16 (Dec 1, 3)     | Final exam review and final exam                 |            |
