calendar/index.html
<!DOCTYPE html>
<html>
<head>
<!-- 2015-08-16 Sun 21:28 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>PPL &#x2013; Syllabus</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Zhitao Gong">
<meta name="description" content="COMP 3220 Principle of Programming Languages, Auburn University">
<meta name="keywords" content="comp3220, principle of programming languages, auburn university">
<link rel="stylesheet" href="/comp3220/css/normalize.css" type="text/css" />
<link rel="stylesheet" href="/comp3220/css/font-awesome.min.css" type="text/css" />
<link rel="stylesheet" href="https://gongzhitaao.github.io/orgcss/org.css" type="text/css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">PPL &#x2013; Syllabus</h1>
</header><hr >

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Week</th>
<th scope="col" class="org-left">Topics</th>
<th scope="col" class="org-left">Homework</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1 (Aug 18, 20)</td>
<td class="org-left">Introduction to  <span class="comp3220-logo">P<sup>2</sup>L</span> and me, preliminaries</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2 (Aug 25, 27)</td>
<td class="org-left">Preliminaries and brief history</td>
<td class="org-left">Homework 1</td>
</tr>

<tr>
<td class="org-left">3 (Sep 1, 3)</td>
<td class="org-left">Describing syntax and semantics, BNF and eBNF</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4 (Sep 8, 10)</td>
<td class="org-left">Describing syntax and semantics, BNF and eBNF</td>
<td class="org-left">Homework 2</td>
</tr>

<tr>
<td class="org-left">5 (Sep 15, 17)</td>
<td class="org-left">Variable names, bindings and scope</td>
<td class="org-left">Homework 3</td>
</tr>

<tr>
<td class="org-left">6 (Sep 22, 24)</td>
<td class="org-left">Review for midterm and midterm exam</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">7 (Sep 29, Oct 1)</td>
<td class="org-left">Data Types</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">8 (Oct 6, 8)</td>
<td class="org-left">Statement and flow control</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">9 (Oct 13, <del>15</del>)</td>
<td class="org-left">Sub-programms</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">10 (Oct 20, 22)</td>
<td class="org-left">Sub-programms implementation</td>
<td class="org-left">Homework 4</td>
</tr>

<tr>
<td class="org-left">11 (Oct 27, 29)</td>
<td class="org-left">Abstract data types</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">12 (Nov 3, 5)</td>
<td class="org-left">Concurrency</td>
<td class="org-left">Homework 5</td>
</tr>

<tr>
<td class="org-left">13 (Nov 10, 12)</td>
<td class="org-left">Prolog and Javascript</td>
<td class="org-left">Homework 6</td>
</tr>

<tr>
<td class="org-left">14 (Nov 17, 20)</td>
<td class="org-left">Exception Handling</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><del>15 (Nov 24, 26)</del></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">16 (Dec 1, 3)</td>
<td class="org-left">Final exam review and final exam</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
<div id="postamble" class="status">
<a class="author"
       href="http://gongzhitaao.org">Zhitao Gong</a> / <span
       class="date">2015-08-16 Sun 21:28</span><span class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.3.1)</span>
</div>
</body>
</html>
